import os
os.system('CLS')

# 1 - Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# N = 20 -> [2,5]
# N = 30 -> [2, 3, 5]

number = int(input('введите число -> '))
Simple_Factor = []
i=2
n=0
while i <= number:
    if number % i == 0 and i % i == 0 and i % 1 == 0:
        Simple_Factor.append(i)
        number /= i
        i+=1
    else:
        i+=1
print(Simple_Factor)

# number = int(input('введите число -> '))
# Simple_Factor = []
# i=0
# n=0
# while i < number:
#     if number % 2 == 0:
#         n = 2
#         Simple_Factor.append(n)
#         number /= 2
#         i+=1
#     elif number % 3 == 0:
#         n = 3
#         Simple_Factor.append(n)
#         number /= 3
#         i+=1
#     elif number % 5 == 0:
#         n = 5
#         Simple_Factor.append(n)
#         number /= 5
#         i+=1
# print(Simple_Factor)

# 2 - Задайте последовательность чисел. Напишите программу, которая выведет список 
# неповторяющихся элементов исходной последовательности. Не использовать множества.
# [1,1,1,1,2,2,2,3,3,3,4] -> [1,2,3,4]

# 3 - В файле, содержащем фамилии студентов и их оценки, изменить на прописные буквы фамилии тех студентов,
# которые имеют средний балл более «4».
# Нужно перезаписать файл.
# Пример:
# Ангела Меркель 5
# Андрей Валетов 5
# Фредди Меркури 3
# Анастасия Пономарева 4

# Программа выдаст:
# АНГЕЛА МЕРКЕЛЬ 5
# АНДРЕЙ ВАЛЕТОВ 5
# Фредди Меркури 3
# Анастасия Пономарева 4

# 4- Шифр Цезаря - это способ шифрования, где каждая буква смещается на определенное количество символов влево или вправо. 
# При расшифровке происходит обратная операция. К примеру, слово "абба" можно зашифровать "бввб" - сдвиг на 1 вправо. 
# "вггв" - сдвиг на 2 вправо, "юяяю" - сдвиг на 2 влево.
# Сдвиг часто называют ключом шифрования.
# Ваша задача - написать функцию, которая записывает в файл шифрованный текст, а также функцию, 
# которая спрашивает ключ, считывает текст и дешифровывает его.

# 5 - Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.
# Входные и выходные данные хранятся в отдельных текстовых файлах.
# файл первый:
# AAAAAAAAAAAABBBBBBBBBBBCCCCCCCCCCDDDDDDEEEEEFFFFG python is sooooooo coooooool
# файл второй:
# сжатый текст.