import os
os.system('CLS')

# 1 - Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# N = 20 -> [2,5]
# N = 30 -> [2, 3, 5]

#def Search_Numbers(number):
    
#    Simple_Factor = []
#    i=2
    
#    while i <= number:
#        if number % i == 0 and i % i == 0 and i % 1 == 0:
#            '''
#            проверяем число с 2 (на 0 делить нельзя и на 1)
#            ввели 20 -> пока i (это с 2) меньше 20
#            проверяем число делится на i нацело
#            делится ли i на саму себя и на 1 нацело 
#            '''
#            Simple_Factor.append(i)
#            number /= i
#            '''
#            уменьшаем число на делением на i и заново в цикл 
#            '''
#            i+=1
#        else:
#            """
#            если число не прошло проверки, просто переходим к следующему
#            """
#            i+=1
#    return Simple_Factor
#number = Search_Numbers(int(input('введите число -> ')))
#print(number)

# 2 - Задайте последовательность чисел. Напишите программу, которая выведет список 
# неповторяющихся элементов исходной последовательности. Не использовать множества.
# [1,1,1,1,2,2,2,3,3,3,4] -> [1,2,3,4]

numbers = [1,1,1,1,2,2,2,3,3,3,4]

def Sort(number):                
    Sort_Number = []
    num = number[0]
    Sort_Number.append(num)
    for i in number:
        if i == num:
            continue
        else:
            num = i
            Sort_Number.append(i)

    return Sort_Number
print(Sort(numbers))

# 3 - В файле, содержащем фамилии студентов и их оценки, изменить на прописные буквы фамилии тех студентов,
# которые имеют средний балл более «4».
# Нужно перезаписать файл.
# Пример:
# Ангела Меркель 5
# Андрей Валетов 5
# Фредди Меркури 3
# Анастасия Пономарева 4

# Программа выдаст:
# АНГЕЛА МЕРКЕЛЬ 5
# АНДРЕЙ ВАЛЕТОВ 5
# Фредди Меркури 3
# Анастасия Пономарева 4

# 4- Шифр Цезаря - это способ шифрования, где каждая буква смещается на определенное количество символов влево или вправо. 
# При расшифровке происходит обратная операция. К примеру, слово "абба" можно зашифровать "бввб" - сдвиг на 1 вправо. 
# "вггв" - сдвиг на 2 вправо, "юяяю" - сдвиг на 2 влево.
# Сдвиг часто называют ключом шифрования.
# Ваша задача - написать функцию, которая записывает в файл шифрованный текст, а также функцию, 
# которая спрашивает ключ, считывает текст и дешифровывает его.

# 5 - Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.
# Входные и выходные данные хранятся в отдельных текстовых файлах.
# файл первый:
# AAAAAAAAAAAABBBBBBBBBBBCCCCCCCCCCDDDDDDEEEEEFFFFG python is sooooooo coooooool
# файл второй:
# сжатый текст.